openwch/ch32x315/EVT/EXAM/SRC/Peripheral/src/ch32x3x5_adc.c
    tmpreg = ADCx->CTLR1;
    tmpreg &= CTLR1_AWDCH_Reset;
    tmpreg |= ADC_Channel;
    ADCx->CTLR1 = tmpreg;
}

/*********************************************************************
 * @fn      ADC_TempSensorVrefintCmd
 *
 * @brief   Enables or disables the temperature sensor and Vrefint channel.
 *
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_TempSensorVrefintCmd(FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        ADC1->CTLR2 |= CTLR2_TSVREFE_Set;
    }
    else
    {
        ADC1->CTLR2 &= CTLR2_TSVREFE_Reset;
    }
}

/*********************************************************************
 * @fn      ADC_GetFlagStatus
 *
 * @brief   Checks whether the specified ADC flag is set or not.
 *
 * @param   ADCx - where x can be 1 to 4 to select the ADC peripheral.
 *          ADC_FLAG - specifies the flag to check.
 *            ADC_FLAG_AWD - Analog watchdog flag.
 *            ADC_FLAG_EOC - End of conversion flag.
 *            ADC_FLAG_JEOC - End of injected group conversion flag.
 *            ADC_FLAG_JSTRT - Start of injected group conversion flag.
 *            ADC_FLAG_STRT - Start of regular group conversion flag.
 *            ADC_FLAG_RST - RST of ADC flag.
 *
 * @return  FlagStatus: SET or RESET.
 */
FlagStatus ADC_GetFlagStatus(ADC_TypeDef *ADCx, uint16_t ADC_FLAG)
{
    FlagStatus bitstatus = RESET;

    if((ADCx->STATR & ADC_FLAG) != (uint16_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    return bitstatus;
}

/*********************************************************************
 * @fn      ADC_ClearFlag
 *
 * @brief   Clears the ADCx's pending flags.
 *
 * @param   ADCx - where x can be 1 to 4 to select the ADC peripheral.
 *          ADC_FLAG - specifies the flag to clear.
 *            ADC_FLAG_AWD - Analog watchdog flag.
 *            ADC_FLAG_EOC - End of conversion flag.
 *            ADC_FLAG_JEOC - End of injected group conversion flag.
 *            ADC_FLAG_JSTRT - Start of injected group conversion flag.
 *            ADC_FLAG_STRT - Start of regular group conversion flag.
 *
 * @return  none
 */
void ADC_ClearFlag(ADC_TypeDef *ADCx, uint8_t ADC_FLAG)
{
    ADCx->STATR = ~(uint32_t)ADC_FLAG;
}

/*********************************************************************
 * @fn      ADC_GetITStatus
 *
 * @brief   Checks whether the specified ADC interrupt has occurred or not.
 *
 * @param   ADCx - where x can be 1 to 4 to select the ADC peripheral.
 *          ADC_IT - specifies the ADC interrupt source to check.
 *            ADC_IT_EOC - End of conversion interrupt mask.
 *            ADC_IT_AWD - Analog watchdog interrupt mask.
 *            ADC_IT_JEOC - End of injected conversion interrupt mask.
 *
 * @return  FlagStatus: SET or RESET.
 */
ITStatus ADC_GetITStatus(ADC_TypeDef *ADCx, uint16_t ADC_IT)
{
    ITStatus bitstatus = RESET;
    uint32_t itmask = 0, enablestatus = 0;

    itmask = ADC_IT >> 8;
    enablestatus = (ADCx->CTLR1 & (uint8_t)ADC_IT);

    if(((ADCx->STATR & itmask) != (uint32_t)RESET) && enablestatus)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    return bitstatus;
}

/*********************************************************************
 * @fn      ADC_ClearITPendingBit
 *
 * @brief   Clears the ADCx's interrupt pending bits.
 *
 * @param   ADCx - where x can be 1 to 4to select the ADC peripheral.
 *          ADC_IT - specifies the ADC interrupt pending bit to clear.
 *            ADC_IT_EOC - End of conversion interrupt mask.
 *            ADC_IT_AWD - Analog watchdog interrupt mask.
 *            ADC_IT_JEOC - End of injected conversion interrupt mask.
 *
 * @return  none
 */
void ADC_ClearITPendingBit(ADC_TypeDef *ADCx, uint16_t ADC_IT)
{
    uint8_t itmask = 0;

    itmask = (uint8_t)(ADC_IT >> 8);
    ADCx->STATR = ~(uint32_t)itmask;
}

/*********************************************************************
 * @fn      ADC_BufferCmd
 *
 * @brief   Enables or disables the ADCx buffer.
 *
 * @param   ADCx - where x can be 1 to 4 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_BufferCmd(ADC_TypeDef *ADCx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        ADCx->CTLR1 |= (1 << 26);
    }
    else
    {
        ADCx->CTLR1 &= ~(1 << 26);
    }
}

/*********************************************************************
 * @fn      ADC_AnalogWatchdogResetCmd
 *
 * @brief   Enables or disables the analog watchdog reset
 *
 * @param   ADCx - where x can be 1 to 4 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_AnalogWatchdogResetCmd(ADC_TypeDef *ADCx,  FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
      ADCx->CTLR1 |= (1<<29);
  }
  else
  {
      ADCx->CTLR1 &= ~(1<<29);
  }
}

/*********************************************************************
 * @fn      ADC_RegularChannelCascadeCmd
 *
 * @brief   Enables or disables the ADC Regular Channel Cascade
 *
 * @param   ADCx - where x can be 1 to 4 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *         
 * @return  none
 */
void ADC_RegularChannelCascadeCmd(ADC_TypeDef *ADCx, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
      ADCx->CTLR2 |= (1<<26);
  }
  else
  {
      ADCx->CTLR2 &= ~(1<<26);
  }
}

/*********************************************************************
 * @fn      ADC_InjectedChannelCascadeCmd
 *
 * @brief   Enables or disables the ADC Injected Channel Cascade
 *
 * @param   ADCx - where x can be 1 to 4 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *         
 * @return  none
 */
void ADC_InjectedChannelCascadeCmd(ADC_TypeDef *ADCx, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
      ADCx->CTLR2 |= (1<<27);
  }
  else
  {
      ADCx->CTLR2 &= ~(1<<27);
  }
}

/*********************************************************************
 * @fn      ADC_CascadeContsFrontConfig
 *
 * @brief   the ADC Front Cascade conts select
 *
 * @param   ADCx - where x can be 1 to 4 to select the ADC peripheral.
 *          ADC_CONTS_Front -  the ADC Cascademode configuration.
 *            ADC_CONTS_Front_ADC1 -  select Front Cascade of ADC1.
 *            ADC_CONTS_Front_ADC2 -  select Front Cascade of ADC2.
 *            ADC_CONTS_Front_ADC3 -  select Front Cascade of ADC3.
 *            ADC_CONTS_Front_ADC4 -  select Front Cascade of ADC4.
 *         
 * @return  none
 */
void ADC_CascadeContsFrontConfig(ADC_TypeDef *ADCx,  uint32_t ADC_CONTS_Front)
{
    uint32_t tmpreg = 0;

    tmpreg = ADCx->CTLR2;
    tmpreg &= CTLR1_CONTS_Reset;
    tmpreg |= ADC_CONTS_Front;
    ADCx->CTLR2 = tmpreg;
}
/*********************************************************************
 * @fn      ADC_InjectedChannelCascadeDLYConfig
 *
 * @brief   the Cascade of ADC injected Channel delay
 *
 * @param   ADCx - where x can be 1 to 4 to select the ADC peripheral.
 *          ADC_INJE_DLY - This parameter must range from 0 to 0x3F.
 *         
 * @return  none
 */
void ADC_InjectedChannelCascadeDLYConfig(ADC_TypeDef *ADCx,  uint8_t ADC_INJE_DLY)
{
    uint32_t tmpreg = 0;

