openwch/ch32x315/EVT/EXAM/SRC/Peripheral/src/ch32x3x5_adc.c
    tmpreg = ADCx->CONCFG;
    tmpreg &= ADC_INJEDLY_Mask;
    ADC_INJE_DLY &= 0x3F;
    tmpreg |= (ADC_INJE_DLY << 8);
    ADCx->CONCFG = tmpreg;
}

/*********************************************************************
 * @fn      ADC_RegularChannelCascadeDLYConfig
 *
 * @brief   the Cascade of ADC regular Channel delay
 *
 * @param   ADCx - where x can be 1 to 4 to select the ADC peripheral.
 *          ADC_REGU_DLY - This parameter must range from 0 to 0x3F.
 *         
 * @return  none
 */
void ADC_RegularChannelCascadeDLYConfig(ADC_TypeDef *ADCx,  uint8_t ADC_REGU_DLY)
{
    uint32_t tmpreg = 0;

    tmpreg = ADCx->CONCFG;
    tmpreg &= ADC_REGUDLY_Mask;
    ADC_REGU_DLY &= 0x3F;
    tmpreg |= ADC_REGU_DLY;
    ADCx->CONCFG = tmpreg;
}

/*********************************************************************
 * @fn      ADC_SampleTimeModeConfig
 *
 * @brief   Configures the sample time mode of ADC.
 *
 * @param   ADCx - where x can be 1 to 4 to select the ADC peripheral.
 *          ADC_Channel - the ADC channel to configure.
 *            ADC_Channel_0 - ADC Channel0 selected.
 *            ADC_Channel_1 - ADC Channel1 selected.
 *            ADC_Channel_2 - ADC Channel2 selected.
 *            ADC_Channel_3 - ADC Channel3 selected.
 *            ADC_Channel_4 - ADC Channel4 selected.
 *            ADC_Channel_5 - ADC Channel5 selected.
 *            ADC_Channel_6 - ADC Channel6 selected.
 *            ADC_Channel_7 - ADC Channel7 selected.
 *            ADC_Channel_8 - ADC Channel8 selected.
 *            ADC_Channel_9 - ADC Channel9 selected.
 *            ADC_Channel_10 - ADC Channel10 selected.
 *            ADC_Channel_11 - ADC Channel11 selected.
 *            ADC_Channel_12 - ADC Channel12 selected.
 *          ADC_ST_Mode - Sample Time Mode.
 *            ADC_Sample_Time_Mode0 - the sample time depend on SMPx[2:0].
 *            ADC_Sample_Time_Mode1 - the sample time depend on SMPUDP[7:0].
 * @return  none
 */
void ADC_SampleTimeModeConfig(ADC_TypeDef *ADCx, uint8_t ADC_Channel, uint8_t ADC_ST_Mode)
{
    if(ADC_ST_Mode == ADC_Sample_Time_Mode0)
    {
        ADCx->SMPMD &= ~(1 << ADC_Channel);
    }
    else if(ADC_ST_Mode == ADC_Sample_Time_Mode1)
    {
        ADCx->SMPMD |= (1 << ADC_Channel);
    }
}

/*********************************************************************
 * @fn      ADC_RegularChannelConfig
 *
 * @brief   Configures for the selected ADC regular channel its sample time.
 *        (@ADC_Sample_Time_Mode0).
 *
 * @param   ADCx - where x can be 1 to 4 to select the ADC peripheral.
 *          ADC_Channel - the ADC channel to configure.
 *            ADC_Channel_0 - ADC Channel0 selected.
 *            ADC_Channel_1 - ADC Channel1 selected.
 *            ADC_Channel_2 - ADC Channel2 selected.
 *            ADC_Channel_3 - ADC Channel3 selected.
 *            ADC_Channel_4 - ADC Channel4 selected.
 *            ADC_Channel_5 - ADC Channel5 selected.
 *            ADC_Channel_6 - ADC Channel6 selected.
 *            ADC_Channel_7 - ADC Channel7 selected.
 *            ADC_Channel_8 - ADC Channel8 selected.
 *            ADC_Channel_9 - ADC Channel9 selected.
 *            ADC_Channel_10 - ADC Channel10 selected.
 *            ADC_Channel_11 - ADC Channel11 selected.
 *            ADC_Channel_12 - ADC Channel12 selected.
 *          ADC_SampleTime - The sample time value to be set for the selected channel.
 *            ADC_SampleTime_CyclesMode0 - Sample time mode 0.
 *            ADC_SampleTime_CyclesMode1 - Sample time mode 1.
 *            ADC_SampleTime_CyclesMode2 - Sample time mode 2.
 *            ADC_SampleTime_CyclesMode3 - Sample time mode 3.
 *            ADC_SampleTime_CyclesMode4 - Sample time mode 4.
 *            ADC_SampleTime_CyclesMode5 - Sample time mode 5.
 *            ADC_SampleTime_CyclesMode6 - Sample time mode 6.
 *            ADC_SampleTime_CyclesMode7 - Sample time mode 7.
 *
 * @return  None
 */
void ADC_SetMode0SampleTimeConfig(ADC_TypeDef *ADCx, uint8_t ADC_Channel, uint8_t ADC_SampleTime)
{
    uint32_t tmpreg1 = 0, tmpreg2 = 0;

    if(ADC_Channel > ADC_Channel_9)
    {
        tmpreg1 = ADCx->SAMPTR1;
        tmpreg2 = SAMPTR1_SMP_Set << (3 * (ADC_Channel - 10));
        tmpreg1 &= ~tmpreg2;
        tmpreg2 = (uint32_t)ADC_SampleTime << (3 * (ADC_Channel - 10));
        tmpreg1 |= tmpreg2;
        ADCx->SAMPTR1 = tmpreg1;
    }
    else
    {
        tmpreg1 = ADCx->SAMPTR2;
        tmpreg2 = SAMPTR2_SMP_Set << (3 * ADC_Channel);
        tmpreg1 &= ~tmpreg2;
        tmpreg2 = (uint32_t)ADC_SampleTime << (3 * ADC_Channel);
        tmpreg1 |= tmpreg2;
        ADCx->SAMPTR2 = tmpreg1;
    }
}

/*********************************************************************
 * @fn      ADC_SetMode1SampleTimeConfig
 *
 * @brief   Configures the sample time(@ADC_Sample_Time_Mode1).
 *
 * @param   ADCx - where x can be 1 to 4 to select the ADC peripheral.
 *          ADC_UDP_SMPCLK - the sample time for ADC normal channel.
 *            This parameter must range from 0 to 0x3F.
 *
 * @return   none
 */
void ADC_SetMode1SampleTimeConfig(ADC_TypeDef *ADCx, uint8_t ADC_UDP_SMPCLK) 
{
    ADCx->UDP &= ~(ADC_SMPUDP );
    ADCx->UDP |= (ADC_UDP_SMPCLK );
}
/*********************************************************************
 * @fn      ADC_CAL_SampleTimeConfig
 *
 * @brief   Configures the ADC_CAL CHALE sample time.
 *
 * @param   ADCx - where x can be 1 to 4 to select the ADC peripheral.
 *          ADC_CAL_SMPCLK - the sample time for ADC calibration channel.
 *            This parameter must range from 0 to 0x3F.
 *
 * @return   none
 */
void ADC_CAL_SampleTimeConfig(ADC_TypeDef *ADCx, uint8_t ADC_CAL_SMPCLK) 
{
    ADCx->UDP &= ~(ADC_SMPCAL);
    ADCx->UDP |= (ADC_CAL_SMPCLK << 8);
}
/*********************************************************************
 * @fn      ADC_ScanCountOutputConfig
 *
 * @brief   Configures the Scan Count Output.
 *
 * @param   ADCx - where x can be 1 to 4 to select the ADC peripheral.
 *          ADC_ScanCntOutMode - the Scan Count Output mode.
 *            ADC_ScanCntOutMode0 - SCANOE0 = 0, SCANOE1 = 0, SCANOE2 = 0;
 *            ADC_ScanCntOutMode1 - SCANOE0 = 1, SCANOE1 = 0, SCANOE2 = 0;
 *            ADC_ScanCntOutMode2 - SCANOE0 = 0, SCANOE1 = 1, SCANOE2 = 0;
 *            ADC_ScanCntOutMode3 - SCANOE0 = 1, SCANOE1 = 1, SCANOE2 = 0;
 *            ADC_ScanCntOutMode4 - SCANOE0 = 0, SCANOE1 = 0, SCANOE2 = 1;
 *            ADC_ScanCntOutMode5 - SCANOE0 = 1, SCANOE1 = 0, SCANOE2 = 1;
 *            ADC_ScanCntOutMode6 - SCANOE0 = 0, SCANOE1 = 1, SCANOE2 = 1;
 *            ADC_ScanCntOutMode7 - SCANOE0 = 1, SCANOE1 = 1, SCANOE2 = 1;
 *             
 * @return   none
 */
void ADC_ScanCountOutputConfig(ADC_TypeDef *ADCx,  uint8_t ADC_ScanCntOutMode )
{
    ADCx->SCANCNT &= ADC_SACAN_Mask;
    ADCx->SCANCNT |= ADC_ScanCntOutMode;
}

/*********************************************************************
 * @fn      ADC_ScanChannelSourecConfig
 *
 * @brief   Configures the Scan channel source.
 *
 * @param   ADCx - where x can be 1 to 4 to select the ADC peripheral.
 *          ADC_ScanCH_SRC - the Scan channel source.
 *            ADC_ScanCH_SRC_Regular - Regular as the Scan channel source.
 *            ADC_ScanCH_SRC_Injected - Injected as the Scan channel source.
 *             
 * @return   none
 */
void ADC_ScanModeConfig(ADC_TypeDef *ADCx,  uint8_t ADC_ScanCH_SRC)
{
    if(ADC_ScanCH_SRC == ADC_ScanCH_SRC_Regular)
    {
        ADCx->SCANCNT &= ~ADC_ScanCH_SRC_Injected;
    }
    else if(ADC_ScanCH_SRC == ADC_ScanCH_SRC_Injected)
    {
        ADCx->SCANCNT |= ADC_ScanCH_SRC_Injected;
    }
}

/*********************************************************************
 * @fn      ADC_INJESEQConfig
 *
 * @brief   Configures the Injected trigger..
 *
 * @param   ADCx - where x can be 1 to 4 to select the ADC peripheral.
 *          ADC_INJE_SEQ - the ADC  injected trigger SEG.
 *            ADC_INJE_SEQ1 - the ADC injected SEQ 1 
 *            ADC_INJE_SEQ2 - the ADC injected SEQ 2 
 *            ADC_INJE_SEQ3 - the ADC injected SEQ 3 
 *            ADC_INJE_SEQ4 - the ADC injected SEQ 4
 *          
 * @return   none
 */
void ADC_INJESEQConfig(ADC_TypeDef *ADCx,  uint32_t ADC_INJE_SEQ )
{
    ADCx->CONCFG &= ~ADC_INJE_SEQ4;
    ADCx->CONCFG |= ADC_INJE_SEQ;
}

/*********************************************************************
 * @fn      ADC_INJESEQConfig
 *
 * @brief   Configures the Injected trigger number.
 *
 * @param   ADCx - where x can be 1 to 4 to select the ADC peripheral.
 *          ADC_INJE_NUM - the ADC  injected trigger number.
 *            ADC_INJE_NUM1 - the ADC injected SEQ 1 
 *            ADC_INJE_NUM2 - the ADC injected SEQ 2 
 *            ADC_INJE_NUM3 - the ADC injected SEQ 3 
 *            ADC_INJE_NUM4 - the ADC injected SEQ 4
 *          
 * @return   none
 */
void ADC_INJENUMConfig(ADC_TypeDef *ADCx, uint32_t ADC_INJE_NUM)
{
    ADCx->CONCFG &= ~ADC_INJE_NUM4;
    ADCx->CONCFG |= ADC_INJE_NUM;
}

/*********************************************************************
 * @fn      ADC_ANA_RST_Cmd
 *
 * @brief   Enables or disables the ADCx ANA RST.
 *
 * @param   ADCx - where x can be 1 to 4 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_ANA_RST_Cmd(ADC_TypeDef *ADCx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        ADCx->CTLR1 |= ADC_ANARST;
    }
    else
    {
        ADCx->CTLR1 &= ~ADC_ANARST;
    }
}

/*********************************************************************
 * @fn      ADC_SW_PRE_Cmd
 *
 * @brief   Enables or disables the ADCx SW_PRE.
 *
 * @param   ADCx - where x can be 1 to 4 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_SW_PRE_Cmd(ADC_TypeDef *ADCx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        ADCx->CTLR1 |= ADC_SWPRE;
    }
    else
    {
        ADCx->CTLR1 &= ~ADC_SWPRE;
    }
}

/*********************************************************************
 * @fn      ADC_HD_CalibrationCmd
 *
 * @brief   Enables or disables the specified ADC hardware automatic Calibration.
 *
 * @param   ADCx - where x can be 1 to 4 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_HD_CalibrationCmd(ADC_TypeDef *ADCx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        ADCx->CTLR2 |= (1 << 6);
    }
    else
    {
        ADCx->CTLR2 &= ~(1 << 6);
    }
}

/*********************************************************************
 * @fn      ADC_CalibrationVoltageConfig
 *
 * @brief   Enables or disables the ADCx TO SMP SEL.
 *
 * @param   ADCx - where x can be 1 to 4 to select the ADC peripheral.
 *          CalibrationVoltage_Mode - configer SMPx mode.
 *            ADC_CalibrationVoltage_Mode0 - Calibration voltage 0.
 *            ADC_CalibrationVoltage_Mode1 - Calibration voltage 1.
 *            ADC_CalibrationVoltage_Mode2 - Calibration voltage 2.
 *            ADC_CalibrationVoltage_Mode3 - Calibration voltage 3.
 *
 * @return  none
 */
void ADC_CalibrationVoltageConfig(ADC_TypeDef *ADCx, uint8_t CalibrationVoltage_Mode)
{
    ADCx->CTLR2 &= ~ADC_CalibrationVoltage_Mode3;
    ADCx->CTLR2 |= CalibrationVoltage_Mode;
}

/*********************************************************************
 * @fn      ADC_GetCalibrationOffset
 *
 * @brief   Get Calibration Offset value.
 *
 * @param   ADCx - where x can be 1 t0 4 to select the ADC peripheral.
 *
 * @return  Calibration Offset value.
 */
uint16_t ADC_GetCalibrationOffset(ADC_TypeDef *ADCx)
{
    return ((uint16_t)((ADCx->STATR & ADC_DELTA) >> 16));
}

/*********************************************************************
 * @fn      ADC_ScanSelConfig
 *
 * @brief   ADC Scan Out Select.
 *
 * @param   ADC_SCAN_SEL - ADC Scan Out Select.
 *            ADC1_SCAN_OUT - the ADC1 Select Out 
 *            ADC2_SCAN_OUT - the ADC2 Select Out 
 *            ADC3_SCAN_OUT - the ADC3 Select Out 
 *            ADC4_SCAN_OUT - the ADC4 Select Out 
 *
 * @return  none.
 */
void ADC_ScanSelConfig(uint32_t ADC_SCAN_SEL)
{
    EXTEN->EXTEN_CTR &= ~(ADC4_SCAN_OUT);
    EXTEN->EXTEN_CTR |= (ADC_SCAN_SEL);
}